
# Напишите программу, которая принимает на вход вещественное число и показывает сумму его цифр.
# num = int(input('enter number: '))
# sum = 0
# while (num != 0):
#     sum = sum + num % 10
#     num = num // 10
# print(sum)

# Напишите программу, которая принимает на вход число N и выдает набор произведений чисел от 1 до N.

# num = int(input('Enter number:'))
#
# factorial = 1
# while (num > 1):
#     factorial *= num
#     num -= 1
# print(factorial)


# Задайте список из n чисел, заполненный по формуле (1 + 1/n) ** n и выведите на экран их сумму.

# n = int(input('Enter number:'))
# array = list()
# for i in range(1, n+1):
#     array.append((1 + 1/n) ** n)
# print(array)
# print(round(sum(array)))



